app/views/lists/show.html.erb

SELECT "steps".* FROM "steps" WHERE "steps"."list_id" = ? AND "steps"."complete" = 'f'  [["list_id", 7]]
---
<ul>
  <% @records.steps.incomplete.each do |single_step| %>