app/controllers/lists_controller.rb

    def index
        @var = List.all
---
SELECT "lists".* FROM "lists"

    def create
        @records = List.new(params.require(:list).permit(:name, :reason))
        if @records.save
---
INSERT INTO "lists" ("name", "reason", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hahaha"], ["reason", "iiiiiii"], ["created_at", "2015-04-11 19:02:54.211262"], ["updated_at", "2015-04-11 19:02:54.211262"]]

    def edit
        @records = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]

    def update
        @records = List.find(params[:id])

        if @records.update_attributes(params.require(:list).permit(:name, :reason))
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "lists" SET "reason" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["reason", "update"], ["updated_at", "2015-04-11 19:26:40.352568"], ["id", 1]]

    def show
        @records = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]

    def destroy
        @records = List.find(params[:id])
        @records.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 5]]