app/controllers/steps_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "steps" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "ww"], ["list_id", 7], ["created_at", "2015-04-11 22:04:57.739122"], ["updated_at", "2015-04-11 22:04:57.739122"]]
---
    def create
        @list = List.find(params[:list_id])
        @step = @list.steps.new(params.require(:step).permit(:description))
        if @step.save